app/views/tweets/index.html.erb

       <%= link_to tweet_like_path(id: t.id, tweet_id: t.id), method: :delete do %>
           <p>いいねを取り消す</p><%= t.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 28

       <%= link_to tweet_likes_path(id: t.id, tweet_id: t.id), method: :post do %>
           <p>いいね</p><%= t.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 27

 <% else %>
   <p>いいねの数 = </p><%= t.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 28