app/views/tweets/show.html.erb

    <div>
      <%= c.user.email unless c.user.blank? %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1