app/views/tweets/show.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 14
---
      <%= link_to tweet_like_path(@tweet), method: :delete do %>
         <p>↓いいねを取り消す</p><%= @tweet.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 14
---
      <%= link_to tweet_likes_path(@tweet), method: :post do %>
         <p>↓MVにいいね</p><%= @tweet.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`tweet_id` = 28
---
<% else %>
  <p>いいねの数 = </p><%= @tweet.likes.count %>

SELECT `tags`.* FROM `tags`
---
      　<h5>感想を種類分け（タグ付け）しよう<h5>
        <%= f.collection_check_boxes(:tag_ids, Tag.all, :id, :name) do |tag| %>

SELECT `tags`.* FROM `tags`
---

<% @comment.tags.each do |tag| %>

SELECT `tags`.* FROM `tags`
---
<%= form_tag tweet_path(@tweet.id), method: :get, class: 'boards__searchForm' do %>
  <%= select_tag :tag_id,
                 options_from_collection_for_select(Tag.all, :id, :name, params[:tag_id]),
                 {

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
      　　　　　<tr>
      　　　　　　<td><%= c.user.name unless c.user.blank? %></td>