app/views/users/show.html.erb

<h2>投稿したMV</h2>
<% @user.tweets.each do |t| %>
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 1