app/controllers/comments_controller.rb

    def create
      tweet = Tweet.find(params[:tweet_id])
      comment = tweet.comments.build(comment_params) #buildを使い、contentとtweet_idの二つを同時に代入
      comment.sum =  comment.hun * 60 + comment.byo
      comment.user_id = current_user.id
      if comment.save
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 14 LIMIT 1
INSERT INTO `comments` (`content`, `user_id`, `tweet_id`, `created_at`, `updated_at`, `byo`, `hun`, `sum`) VALUES ('上手', 1, 27, '2021-03-25 11:08:41.433645', '2021-03-25 11:08:41.433645', 40, 3, 220)