app/controllers/tweets_controller.rb

  def index
        @tweet = Tweet.new

        if params[:search] != nil && params[:search] != ''
          #部分検索かつ複数検索
          @tweets = Tweet.where("body LIKE ? ", "%" + params[:search] + "%").or(Tweet.where("title LIKE ? ", "%" + params[:search] + "%"))
        else
          @tweets = Tweet.all
---
SELECT `tweets`.* FROM `tweets` WHERE ((body LIKE '%Beautiful%' ) OR (tweet.title LIKE '%Beautiful%' ))
SELECT `tweets`.* FROM `tweets`

      def create
        tweet = Tweet.new(tweet_params)

        url = params[:tweet][:youtube_url]
        url = url.last(11)
        tweet.youtube_url = url


        tweet.user_id = current_user.id

        if tweet.save
---
INSERT INTO `tweets` (`body`, `created_at`, `updated_at`, `title`, `user_id`, `youtube_url`) VALUES ('ごっこ', '2021-03-25 11:08:10.351462', '2021-03-25 11:08:10.351462', 'いたち', 1, 'ce=hs_email')

      def show
        @tweet = Tweet.find(params[:id])
        @comments = @tweet.comments.order("sum")
        @comment = Comment.new
        @commment_tag = params[:tag_id].present? ? Tag.find(params[:tag_id]).comments : Comment.all
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 3 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 25 ORDER BY sum
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 19
SELECT `tags`.* FROM `tags` WHERE `tags`.`id` = 2 LIMIT 1

      def update
        tweet = Tweet.find(params[:id])
        if tweet.update(tweet_params)
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 25 LIMIT 1
UPDATE `tweets` SET `tweets`.`body` = 'いたちごっこ', `tweets`.`updated_at` = '2021-01-25 09:16:34.720942' WHERE `tweets`.`id` = 3